
public class Main {
    public static void main(String[] args) {

    }
}
//  Выполните следующие инструкции:
//1. Напишите программу, чтобы проверить значения длины и ширины прямоугольника и определить, является ли он квадратным или нет.
//
//2. Магазин предоставит скидку в 10%, если стоимость купленного товара будет больше 5000. Если стоимость товара ниже 5000, то стоимость остается без изменений. Вычислите и выведите итоговую стоимость покупки для пользователя.
//
//3. В университете существуют следующие правила для системы оценок:
//    Ниже 25 - F
//    От 25 до 45 - E
//    От 45 до 50 - D
//    От 50 до 60 - C
//    От 60 до 80 - B
//    Выше 80 - A
//Создайте переменную grade и напечатайте в консоль соответствующую оценку в зависимости от значения переменной.
//
//4. Дано целое положительное число. Напишите программу, которая выводит это число в обратном порядке. Например, если дано число 12345, то вывод будет следующим: 54321.
//
//5. Дано целое положительное число. Напишите программу, которая выводит сообщение о том, является ли это число простым.
//
//6. Напишите программу для печати следующего сообщения:
//i)
//**********
//**********
//**********
//**********
//
//ii)
//*
//**
//***
//****
//*****
//
//iii)
//        1
//      212
//    32123
//  4321234
//543212345
//7. Даны два целых числа a и b. Напишите программу для вычисления суммы натуральных чисел в диапазоне от a до b.
//
//8. В компании прошла аттестация по компетенциям и навыкам сотрудников. Даны зарплата и класс сотрудника. Напишите программу, чтобы определить сумму премии в зависимости от класса сотрудника. Необходимо создать переменную со значением зарплаты сотрудника, вывести в консоль результирующую зарплату с премией.
//
//Бонусы в зависимости от класса:
//    Класс A: 50%
//    Класс B: 25%
//    Класс C: 0%
//
//9. Дано целое положительное число n. Напишите программу для печати ряда Фибоначчи из n членов:
//0 1 1 2 3 5 8 13 24 ..... две переменные a и b, значения которых равны 65 и 80 соответственно. Напишите программу, чтобы проверить, верны ли оба условия 'a < 50' и 'a < b'.